КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/DataProcessors/ЗагрузкаДанныхИзВнешнихФайлов/ЗагрузкаДанныхИзВнешнихФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="be362f21-420b-4b26-aa8a-c81cb604988a">
  <name>ЗагрузкаДанныхИзВнешнихФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="acec7e3d-9efa-4656-84e3-e2f90b295e8a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="296cd400-da83-4189-a85c-0945600b3033">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="79c81c84-222c-44f8-af79-055b8dbba776">
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0bb9272d-3127-4e50-8dc2-6651432168b0">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b342b15c-2804-4411-a312-fe36016103a7">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ad4c47db-68bd-46a0-a3a5-4aa9b0b5c60c">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2fdd2f78-273d-43dd-b9ad-37d30e4c9e19">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d3db2b9a-de0b-456f-80d2-767de6545d37">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d7fe3696-ce1d-4c7e-af5e-21a099241324">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f89bcaae-336b-4883-853f-81dc3377cbbd">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="60572a54-741f-40db-8183-e7c53875600d">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fb990d32-6f14-4d08-b095-afc98d411266">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5f4ecac2-71f1-4e8a-b258-37639de533c6">
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bdfc12db-32a1-4b16-859b-2d4d7992c63c">
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="01dd7c32-3073-4ea3-9b36-edb399c1400e">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0efb0e27-64da-443d-a00e-9a5d244faf4e">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3c01e460-4f2e-4703-98b7-07496cf17fbc">
      <name>МинимальныйОстаток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e64675d5-9331-4bcd-a68e-6a2bb3f4053c">
      <name>МаксимальныйОстаток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовАктивов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c0a070a8-fff5-49fe-8c9e-3fbae30394cb">
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e8352fa6-99c0-4f4b-9227-b1ac7d158a3e">
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c3e7b9be-3656-4800-8e46-0709bd569743">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8852b0c5-f552-486c-868f-ebe8ca0b962f">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f1ffdf4f-c0b4-4011-98ad-7cf60a75cbe8">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2b1ed26b-311f-44e7-b202-264198eec52f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e0295f24-4ca7-4ca7-865f-4569012cb260">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aa374108-b098-4627-8b61-2374cfa17e62">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="680ae0ca-e1f8-48ba-b136-aaa160965f42">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/DataProcessors/ЗагрузкаДанныхИзВнешнихФайлов/Forms/Форма/Module.bsl
&НаСервере
&После("ИнициализироватьТабличныйДокумент")
Процедура ОД_ИнициализироватьТабличныйДокумент()

	МакетЗаполненияПоВнешнемуИсточнику = Обработки.ЗагрузкаДанныхИзВнешнихФайлов.ПолучитьМакет("МакетЗагрузкиДанных");

	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("ДокументРеализации");
	ТабличныйДокумент.Присоединить(ОбластьТовары);

	Область = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("СтатьяРасходовАктивов");
	ТабличныйДокумент.Присоединить(Область);

	Область = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Аналитика");
	ТабличныйДокумент.Присоединить(Область);

КонецПроцедуры

&НаСервере
&Вместо("СопоставитьДанныеТабличногоДокументаСДаннымиИБ")
Процедура ОД_СопоставитьДанныеТабличногоДокументаСДаннымиИБ()

	УточнениеНоменклатуры.Очистить();
	ПодобраннаяНоменклатура.Очистить();
	НайденныеСтроки = ПодобраннаяНоменклатура.Выгрузить();

	Объект.Товары.Очистить();
	
	ДанныеИБ = ПолучитьДанныеИБпоНоменклатуреИхарактеристикам();
	ТаблицаНоменклатуры = ДанныеИБ.ТаблицаНоменклатуры;
	ТаблицаХарактеристик = ДанныеИБ.ТаблицаХарактеристик;
	ТаблицаНоменклатурыПоставщиков = ДанныеИБ.ТаблицаНоменклатурыПоставщиков;
	
	НомераКолонок = Новый Соответствие;
	НомерКолонки = 1;
	
	НомераКолонок.Вставить("КолонкаШтрихкод", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаКод", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаАртикул", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаНоменклатура", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		НомераКолонок.Вставить("КолонкаХарактеристика", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	Если ЗагружатьКоличество Тогда
		НомераКолонок.Вставить("КолонкаКоличество", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	Если ЗагружатьЗапасы Тогда
		НомераКолонок.Вставить("КолонкаМинимальныйОстаток", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
		НомераКолонок.Вставить("КолонкаМаксимальныйОстаток", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	Если ЗагружатьЦены Тогда
		НомераКолонок.Вставить("КолонкаЦена", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
		// Зинаков 17.02.26 для документа Заявка на возврат товаров от клиента
		Если ИмяТЧ = "ВозвращаемыеТовары" Тогда
			НомераКолонок.Вставить("ДокументРеализации", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
			НомерКолонки = НомерКолонки +1;
		КонецЕсли;
	КонецЕсли;

	Если ЗагружатьСуммы Тогда
		Если ИспользоватьРучныеСкидкиВЗакупках И ЗагружатьСкидки Тогда
			НомераКолонок.Вставить("КолонкаПроцентРучнойСкидки", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
			НомерКолонки = НомерКолонки +1;
			НомераКолонок.Вставить("КолонкаСуммаРучнойСкидки", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
			НомерКолонки = НомерКолонки +1;
		КонецЕсли;
		НомераКолонок.Вставить("КолонкаСумма", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
		Если НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС Тогда
			НомераКолонок.Вставить("КолонкаСуммаНДС", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
			НомерКолонки = НомерКолонки +1;
			Если НЕ ЦенаВключаетНДС Тогда
				НомераКолонок.Вставить("КолонкаСуммаСНДС", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
				НомерКолонки = НомерКолонки +1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗагружатьГТД Тогда
		НомераКолонок.Вставить("КолонкаНомерГТД", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
		НомераКолонок.Вставить("КолонкаСтранаПроисхождения", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;

	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("СтатьяРасходовАктивов", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("Аналитика", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	
	ВысотаШапки = 1;
	НомерСтроки = ВысотаШапки + 1 ;
	
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст)
		Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст)
		Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст)
		Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст);
	ЕстьОшибкиРаспознавания = Ложь;
	
	УпаковочныйЛистСинонимВРег   = СтрЗаменить(ВРег(Метаданные.Документы.УпаковочныйЛист.Синоним), " ", "");
	ДлинаСинонимаУпаковочныйЛист = СтрДлина(УпаковочныйЛистСинонимВРег);
	КодыУпаковочныхЛистовНаПроверку.Очистить();
	
	Пока ЗаполненыНоменклатураКодАртикулШтрихкод Цикл
		
		НоваяСтрока = УточнениеНоменклатуры.Добавить();
		Количество = 0;
		НоваяСтрока.КодСтроки = НомерСтроки;
		
		Попытка
			НоваяСтрока.Штрихкод = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст;
			НоваяСтрока.Код = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст;
			НоваяСтрока.Артикул = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст;
			НоваяСтрока.НоменклатураНаименование = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст;
			Если ИспользоватьХарактеристикиНоменклатуры Тогда
				НоваяСтрока.ХарактеристикаНаименование = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаХарактеристика")).Текст;
			КонецЕсли;
			Если ЗагружатьКоличество Тогда
				Количество = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКоличество")).Текст;
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Если ЗагружатьКоличество Тогда
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.Количество, Количество, НомерСтроки, "Количество", ВысотаШапки);
		КонецЕсли;
		
		Если ЗагружатьЗапасы Тогда

			МинимальныйОстаток = 0;
			Попытка
				МинимальныйОстаток = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаМинимальныйОстаток")).Текст;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;

			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.МинимальныйОстаток, МинимальныйОстаток, НомерСтроки, "МинимальныйОстаток", ВысотаШапки);

			МаксимальныйОстаток = 0;
			Попытка
				МаксимальныйОстаток = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаМаксимальныйОстаток")).Текст;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;

			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.МаксимальныйОстаток, МаксимальныйОстаток, НомерСтроки, "МаксимальныйОстаток", ВысотаШапки);

		КонецЕсли;

		Если ЗагружатьЦены Тогда
			Цена = 0;
			Попытка
				Цена = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаЦена")).Текст;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.Цена, Цена, НомерСтроки, "Цена", ВысотаШапки);
			
		КонецЕсли;
		
		Если ЗагружатьСуммы Тогда
			ПроцентРучнойСкидки = 0;
			СуммаРучнойСкидки   = 0;
			Сумма               = 0;
			СуммаНДС            = 0;
			СуммаСНДС           = 0;
			
			Попытка
				Если ИспользоватьРучныеСкидкиВЗакупках И ЗагружатьСкидки Тогда
					ПроцентРучнойСкидки = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаПроцентРучнойСкидки")).Текст;
					СуммаРучнойСкидки = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаСуммаРучнойСкидки")).Текст;
					ПроцентРучнойСкидки = СтрЗаменить(ПроцентРучнойСкидки, "%", "");
				КонецЕсли;
				Если НомераКолонок.Получить("КолонкаСумма") <>  Неопределено Тогда
					Сумма     = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаСумма")).Текст;
				КонецЕсли;
				Если НомераКолонок.Получить("КолонкаСуммаНДС") <>  Неопределено Тогда
					СуммаНДС  = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаСуммаНДС")).Текст;
				КонецЕсли;
				Если НомераКолонок.Получить("КолонкаСуммаСНДС") <>  Неопределено Тогда
					СуммаСНДС = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаСуммаСНДС")).Текст;
				КонецЕсли;
				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.ПроцентРучнойСкидки, ПроцентРучнойСкидки, НомерСтроки, "ПроцентРучнойСкидки", ВысотаШапки);
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.СуммаРучнойСкидки, СуммаРучнойСкидки, НомерСтроки, "СуммаРучнойСкидки", ВысотаШапки);
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.Сумма, Сумма, НомерСтроки, "Сумма", ВысотаШапки);
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.СуммаНДС, СуммаНДС, НомерСтроки, "СуммаНДС", ВысотаШапки);
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.СуммаСНДС, СуммаСНДС, НомерСтроки, "СуммаСНДС", ВысотаШапки);
			
		КонецЕсли;
		
		Если ЗагружатьГТД Тогда
			Попытка
				НомерГТД            = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНомерГТД")).Текст;
				СтранаПроисхождения = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаСтранаПроисхождения")).Текст;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
			Если ЗначениеЗаполнено(НомерГТД) Тогда
				НоваяСтрока.НомерГТД             = СокрЛП(НомерГТД);
				Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
					НоваяСтрока.СтранаПроисхождения  = ВРег(СокрЛП(СтранаПроисхождения));
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;

		НомерДокументаРеализации = "";
		Попытка
			НомерДокументаРеализации = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("ДокументРеализации")).Текст;
		Исключение
		КонецПопытки;

		СтатьяРасходовАктивов = "";
		Попытка
			СтатьяРасходовАктивов = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("СтатьяРасходовАктивов")).Текст;
		Исключение
		КонецПопытки;
		
		Аналитика = "";
		Попытка
			Аналитика = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("Аналитика")).Текст;
		Исключение
		КонецПопытки;
		
		СтрокаПоискаКод            = ВРег(СтрЗаменить(НоваяСтрока.Код, " ", "")); 
		СтрокаПоискаАртикул        = ВРег(СтрЗаменить(НоваяСтрока.Артикул, " ", "")); 
		СтрокаПоискаНоменклатура   = ВРег(СтрЗаменить(НоваяСтрока.НоменклатураНаименование, " ", ""));
		СтрокаПоискаХарактеристика = ВРег(СтрЗаменить(НоваяСтрока.ХарактеристикаНаименование, " ", ""));
		
		Если ЗначениеЗаполнено(НоваяСтрока.Штрихкод) Тогда
			ШтрихКодБезПробелов = СтрЗаменить(НоваяСтрока.Штрихкод, " ", "");
			ВыборкаНайденныхНоменклатур = ПодобратьНоменклатуруПоШтрихкоду(ШтрихКодБезПробелов);
			Если ВыборкаНайденныхНоменклатур.Количество() > 0 Тогда
				Пока ВыборкаНайденныхНоменклатур.Следующий() Цикл
					ПодобраннаяСтрока = ПодобраннаяНоменклатура.Добавить();
					ПодобраннаяСтрока.КодСтроки = НомерСтроки;
					ЗаполнитьЗначенияСвойств(ПодобраннаяСтрока, ВыборкаНайденныхНоменклатур);
				КонецЦикла;
			ИначеЕсли Объект.ЗагружатьУпаковочныеЛисты Тогда
				СтрокаСНовымКодом = КодыУпаковочныхЛистовНаПроверку.Добавить();
				СтрокаСНовымКодом.Код = ШтрихКодБезПробелов;
				СтрокаСНовымКодом.КодСтроки = НомерСтроки;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.Код) И ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНаименование) Тогда
			
			Связи = Новый Структура("ЗначениеДляОтбораХарактеристик", "ЗначениеДляОтбораХарактеристик");
			ПоляНайденныхРанееДляРезультата = Новый Структура("Номенклатура", "Номенклатура");
			ПоляСвязаннойТаблицыДляРезультата = Новый Структура("Характеристика", "Характеристика");
			
			НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Код", СтрокаПоискаКод));
			ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеХарактеристикиПоиск", СтрокаПоискаХарактеристика);
			НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоКлючу, ТаблицаХарактеристик, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеХарактеристикиПолноеПоиск", СтрокаПоискаХарактеристика);
				НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоКлючу, ТаблицаХарактеристик, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
				Если НайденныеСтроки.Количество() = 0 Тогда
					НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоКлючу, ТаблицаХарактеристик, Связи, Новый Структура, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
				КонецЕсли;
			КонецЕсли;
			Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
				ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НайденнаяСтрока.Номенклатура, НайденнаяСтрока.Характеристика);
			КонецЦикла;	
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.Артикул) И ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование) И ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНаименование) Тогда
			
			Связи = Новый Структура("ЗначениеДляОтбораХарактеристик", "ЗначениеДляОтбораХарактеристик");
			ПоляНайденныхРанееДляРезультата = Новый Структура("Номенклатура", "Номенклатура");
			ПоляСвязаннойТаблицыДляРезультата = Новый Структура("Характеристика", "Характеристика");
			НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск, НаименованиеПоиск", СтрокаПоискаАртикул, СтрокаПоискаНоменклатура));
			ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеХарактеристикиПоиск", СтрокаПоискаХарактеристика);
			НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоКлючу, ТаблицаХарактеристик, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеХарактеристикиПолноеПоиск", СтрокаПоискаХарактеристика);
				НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоКлючу, ТаблицаХарактеристик, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
			КонецЕсли;
			Если НайденныеСтроки.Количество() = 0 Тогда
				НайденнаяНоменклатураПоАртикулНаименованиеПолное = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск, НаименованиеПолноеПоиск", СтрокаПоискаАртикул, СтрокаПоискаНоменклатура));
				ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеХарактеристикиПоиск", СтрокаПоискаХарактеристика);
				НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоАртикулНаименованиеПолное, ТаблицаХарактеристик, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
				Если НайденныеСтроки.Количество() = 0 Тогда
					ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеХарактеристикиПолноеПоиск", СтрокаПоискаХарактеристика);
					НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоАртикулНаименованиеПолное, ТаблицаХарактеристик, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
				КонецЕсли;
			КонецЕсли;
			НашлиНоменклатуруПоставщиков = Ложь;
			Если НайденныеСтроки.Количество() = 0 Тогда
				НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоКлючу, ТаблицаХарактеристик, Связи, Новый Структура, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
				Если НайденныеСтроки.Количество() = 0 Тогда
					НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоАртикулНаименованиеПолное, ТаблицаХарактеристик, Связи, Новый Структура, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
					Если НайденныеСтроки.Количество() = 0 Тогда
						НайденныеСтроки = ТаблицаНоменклатурыПоставщиков.НайтиСтроки(Новый Структура("АртикулПоставщикаПоиск, НоменклатураПартнераПоиск", СтрокаПоискаАртикул, СтрокаПоискаНоменклатура));
						НашлиНоменклатуруПоставщиков = (НайденныеСтроки.Количество()>0);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
			Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
				ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НайденнаяСтрока.Номенклатура, НайденнаяСтрока.Характеристика, ?(НашлиНоменклатуруПоставщиков, НайденнаяСтрока.НоменклатураПартнера, Неопределено));
			КонецЦикла;	
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.Код) И НЕ ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНаименование) Тогда
			
			НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Код, НаименованиеПоиск", СтрокаПоискаКод, СтрокаПоискаНоменклатура));
			Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
				НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Код, НаименованиеПолноеПоиск", СтрокаПоискаКод, СтрокаПоискаНоменклатура));
				Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
					НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Код", СтрокаПоискаКод));
				КонецЕсли;
			КонецЕсли;
			Для каждого НоменклатураПоКлючу из НайденнаяНоменклатураПоКлючу Цикл
				ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура);
			КонецЦикла;			
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.Артикул) И ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование) И НЕ ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНаименование) Тогда
			НашлиНоменклатуруПоставщиков = Ложь;
			НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск, НаименованиеПоиск", СтрокаПоискаАртикул,	СтрокаПоискаНоменклатура));
			Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
				НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск, НаименованиеПолноеПоиск",	СтрокаПоискаАртикул, СтрокаПоискаНоменклатура));
				Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
					НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск", СтрокаПоискаАртикул));
					Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
						НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатурыПоставщиков.НайтиСтроки(Новый Структура("АртикулПоставщикаПоиск, НоменклатураПартнераПоиск", СтрокаПоискаАртикул, СтрокаПоискаНоменклатура));
						НашлиНоменклатуруПоставщиков = (НайденнаяНоменклатураПоКлючу.Количество()>0);
						Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
							НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатурыПоставщиков.НайтиСтроки(Новый Структура("АртикулПоставщикаПоиск", СтрокаПоискаАртикул));
							НашлиНоменклатуруПоставщиков = (НайденнаяНоменклатураПоКлючу.Количество()>0);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Для каждого НоменклатураПоКлючу из НайденнаяНоменклатураПоКлючу Цикл
				Если НашлиНоменклатуруПоставщиков Тогда
					ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура, НоменклатураПоКлючу.Характеристика, НоменклатураПоКлючу.НоменклатураПартнера);
				Иначе
					ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура);
				КонецЕсли;	
			КонецЦикла;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.Артикул) И ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование) И ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНаименование) Тогда
			
			Связи = Новый Структура("ЗначениеДляОтбораХарактеристик", "ЗначениеДляОтбораХарактеристик");
			ПоляНайденныхРанееДляРезультата = Новый Структура("Характеристика", "Характеристика");
			ПоляСвязаннойТаблицыДляРезультата = Новый Структура("Номенклатура", "Номенклатура");
			
			НайденныеХарактеристикиПоКлючу = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("НаименованиеХарактеристикиПоиск", СтрокаПоискаХарактеристика));
			ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеПоиск", СтрокаПоискаНоменклатура);
			НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденныеХарактеристикиПоКлючу, ТаблицаНоменклатуры, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеПолноеПоиск", СтрокаПоискаНоменклатура);
				НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденныеХарактеристикиПоКлючу, ТаблицаНоменклатуры, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
				Если НайденныеСтроки.Количество() = 0 Тогда
					НайденныеХарактеристикиПоКлючу = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("НаименованиеХарактеристикиПолноеПоиск", СтрокаПоискаХарактеристика));
					ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеПоиск", СтрокаПоискаНоменклатура);
					НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденныеХарактеристикиПоКлючу, ТаблицаНоменклатуры, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
					Если НайденныеСтроки.Количество() = 0 Тогда
						ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеПолноеПоиск", СтрокаПоискаНоменклатура);
						НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденныеХарактеристикиПоКлючу, ТаблицаНоменклатуры, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				НашлиНоменклатуруПоставщиков = Ложь;
				НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("НаименованиеПоиск",	СтрокаПоискаНоменклатура));
				Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
					НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("НаименованиеПолноеПоиск", СтрокаПоискаНоменклатура));
					Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
						НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатурыПоставщиков.НайтиСтроки(Новый Структура("НоменклатураПартнераПоиск", СтрокаПоискаНоменклатура));
						НашлиНоменклатуруПоставщиков = (НайденнаяНоменклатураПоКлючу.Количество()>0);
					КонецЕсли;
				КонецЕсли;
				Для каждого НоменклатураПоКлючу из НайденнаяНоменклатураПоКлючу Цикл
					Если НашлиНоменклатуруПоставщиков Тогда
						ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура, НоменклатураПоКлючу.Характеристика, НоменклатураПоКлючу.НоменклатураПартнера);
					Иначе
						НайденныеХарактеристикиПоКлючу = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("ЗначениеДляОтбораХарактеристик", НоменклатураПоКлючу.ЗначениеДляОтбораХарактеристик));
						Для каждого ХарактеристикаПоКлючу из НайденныеХарактеристикиПоКлючу Цикл
							ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура, ХарактеристикаПоКлючу.Характеристика);
						КонецЦикла;	
					КонецЕсли;	
				КонецЦикла;
			Иначе
				Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
					ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НайденнаяСтрока.Номенклатура, НайденнаяСтрока.Характеристика);
				КонецЦикла;			
			КонецЕсли;	
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.Артикул) И НЕ ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование) И НЕ ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНаименование) Тогда
			
			НашлиНоменклатуруПоставщиков = Ложь;
			НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск",	СтрокаПоискаАртикул));
			Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
				НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатурыПоставщиков.НайтиСтроки(Новый Структура("АртикулПоставщикаПоиск", СтрокаПоискаАртикул));
				НашлиНоменклатуруПоставщиков = (НайденнаяНоменклатураПоКлючу.Количество()>0);
			КонецЕсли;
			Для каждого НоменклатураПоКлючу из НайденнаяНоменклатураПоКлючу Цикл
				Если НашлиНоменклатуруПоставщиков Тогда
					ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура, НоменклатураПоКлючу.Характеристика, НоменклатураПоКлючу.НоменклатураПартнера);
				Иначе
					ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура);
				КонецЕсли;	
			КонецЦикла;
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.Артикул) И НЕ ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование) И ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНаименование) Тогда
			
			Связи = Новый Структура("ЗначениеДляОтбораХарактеристик", "ЗначениеДляОтбораХарактеристик");
			ПоляНайденныхРанееДляРезультата = Новый Структура("Номенклатура", "Номенклатура");
			ПоляСвязаннойТаблицыДляРезультата = Новый Структура("Характеристика", "Характеристика");
			НашлиНоменклатуруПоставщиков = Ложь;
			НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск", СтрокаПоискаАртикул));
			ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеХарактеристикиПоиск", СтрокаПоискаХарактеристика);
			НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоКлючу, ТаблицаХарактеристик, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ОтборПоСвязаннойТаблице = Новый Структура("НаименованиеХарактеристикиПолноеПоиск", СтрокаПоискаХарактеристика);
				НайденныеСтроки = ПоискПоСвязаннойТаблице(НайденнаяНоменклатураПоКлючу, ТаблицаХарактеристик, Связи, ОтборПоСвязаннойТаблице, ПоляНайденныхРанееДляРезультата, ПоляСвязаннойТаблицыДляРезультата);
				Если НайденныеСтроки.Количество() = 0 Тогда
					НайденныеСтроки = ТаблицаНоменклатурыПоставщиков.НайтиСтроки(Новый Структура("АртикулПоставщикаПоиск", СтрокаПоискаАртикул));
					НашлиНоменклатуруПоставщиков = (НайденныеСтроки.Количество()>0);
				КонецЕсли;
			КонецЕсли;
			
			Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
				ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НайденнаяСтрока.Номенклатура, НайденнаяСтрока.Характеристика, ?(НашлиНоменклатуруПоставщиков, НайденнаяСтрока.НоменклатураПартнера, Неопределено) );
			КонецЦикла;	

		ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.Артикул) И ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование) И НЕ ЗначениеЗаполнено(НоваяСтрока.ХарактеристикаНаименование) Тогда
			
			
			Если Объект.ЗагружатьУпаковочныеЛисты
				И СтрНайти(СтрокаПоискаНоменклатура, УпаковочныйЛистСинонимВРег) = 1 Тогда
				ПозицияОкончанияКода = СтрНайти(ВРег(НоваяСтрока.НоменклатураНаименование), " " + НСтр("ru='ОТ'") + " ") - 1;
				
				Если ПозицияОкончанияКода > 0 Тогда
					СтрокаПоискаКодаУпЛиста = СтрЗаменить(Лев(НоваяСтрока.НоменклатураНаименование, ПозицияОкончанияКода), " ", "");
				Иначе
					СтрокаПоискаКодаУпЛиста = СтрЗаменить(НоваяСтрока.НоменклатураНаименование, " ", "");
				КонецЕсли;
				СтрокаПоискаКодаУпЛиста = Сред(СтрокаПоискаКодаУпЛиста, ДлинаСинонимаУпаковочныйЛист + 1);
				СтрокаСНовымКодом = КодыУпаковочныхЛистовНаПроверку.Добавить();
				СтрокаСНовымКодом.Код = СтрокаПоискаКодаУпЛиста;
				СтрокаСНовымКодом.КодСтроки = НомерСтроки;
			Иначе
				
				
				НашлиНоменклатуруПоставщиков = Ложь;
				НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("НаименованиеПоиск",	СтрокаПоискаНоменклатура));
				Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
					НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("НаименованиеПолноеПоиск", СтрокаПоискаНоменклатура));
					Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
						НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатурыПоставщиков.НайтиСтроки(Новый Структура("НоменклатураПартнераПоиск", СтрокаПоискаНоменклатура));
						НашлиНоменклатуруПоставщиков = (НайденнаяНоменклатураПоКлючу.Количество()>0);
					КонецЕсли;
				КонецЕсли;
				Для каждого НоменклатураПоКлючу из НайденнаяНоменклатураПоКлючу Цикл
					Если НашлиНоменклатуруПоставщиков Тогда
						ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура, НоменклатураПоКлючу.Характеристика, НоменклатураПоКлючу.НоменклатураПартнера);
					Иначе
						ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура);
					КонецЕсли;	
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Заполнение тч Товары.
		НоваяСтрокаТовары = Объект.Товары.Добавить();
		НоваяСтрокаТовары.ЗагружаемаяНоменклатура    = НоваяСтрока.НоменклатураНаименование;
		НоваяСтрокаТовары.ЗагружаемаяХарактеристика  = НоваяСтрока.ХарактеристикаНаименование;
		НоваяСтрокаТовары.ЗагружаемыйАртикул         = НоваяСтрока.Артикул;
		НоваяСтрокаТовары.ЗагружаемыйШтрихкод        = НоваяСтрока.Штрихкод;
		НоваяСтрокаТовары.ЗагружаемыйКод             = НоваяСтрока.Код;
		НоваяСтрокаТовары.ЗагружаемыйНомерГТД        = НоваяСтрока.НомерГТД;
		НоваяСтрокаТовары.ЗагружаемаяСтранаПроисхождения = НоваяСтрока.СтранаПроисхождения;
		Если ЗагружатьКоличество Тогда
			НоваяСтрокаТовары.КоличествоУпаковок        = НоваяСтрока.Количество;
		КонецЕсли;
		НоваяСтрокаТовары.КодСтроки                  = НомерСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, НоваяСтрока,,"Артикул");
		
		МассивПодобраннойНоменклатуры = ПодобраннаяНоменклатура.НайтиСтроки(Новый Структура("КодСтроки", НомерСтроки));
		
		Если МассивПодобраннойНоменклатуры.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, МассивПодобраннойНоменклатуры.Получить(0));
		ИначеЕсли МассивПодобраннойНоменклатуры.Количество() = 0 Тогда
			ТекстОшибки = НСтр("ru='По данным для поиска в строке %НомерСтроки% совпадений не найдено.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки-ВысотаШапки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Иначе
			ТекстОшибки = НСтр("ru='По данным для поиска в строке %НомерСтроки% найдено несколько совпадений.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки-ВысотаШапки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата", НалогообложениеНДС, Дата));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", ВернутьМногооборотнуюТару);
		Если ЗагружатьКоличество Тогда
		
			Если НоваяСтрокаТовары.Количество > 0 Тогда
				СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			КонецЕсли;

		КонецЕсли;
		
		Если НЕ НеПересчитыватьСуммовыеПоказатели Тогда
			СтруктураПересчетаСуммы = Новый Структура;
			СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", ЦенаВключаетНДС);
			
			ЕстьСкидки = ЗначениеЗаполнено(НоваяСтрока.СуммаРучнойСкидки) ИЛИ ЗначениеЗаполнено(НоваяСтрока.ПроцентРучнойСкидки);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СуммаНДС) ИЛИ ЕстьСкидки Тогда
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СуммаСНДС)  ИЛИ ЕстьСкидки Тогда
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Сумма) ИЛИ ЕстьСкидки Тогда
				СтруктураДействий.Вставить("ПересчитатьСумму");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СуммаРучнойСкидки) И ЗначениеЗаполнено(НоваяСтрока.ПроцентРучнойСкидки) Тогда
				СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
			КонецЕсли;
			Если ЗначениеЗаполнено(НоваяСтрока.СуммаРучнойСкидки) И НЕ ЗначениеЗаполнено(НоваяСтрока.ПроцентРучнойСкидки) Тогда
				СтруктураДействий.Вставить("ПересчитатьПроцентРучнойСкидки");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.СуммаРучнойСкидки) ИЛИ ЗначениеЗаполнено(НоваяСтрока.ПроцентРучнойСкидки) Тогда
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
			КонецЕсли;
			
		КонецЕсли;
		
		Если НоваяСтрокаТовары.Цена = 0 
			И НоваяСтрокаТовары.Сумма <> 0
			И НоваяСтрокаТовары.Количество <> 0 Тогда
			НоваяСтрокаТовары.Цена = НоваяСтрокаТовары.Сумма / НоваяСтрокаТовары.Количество;
		КонецЕсли;
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрокаТовары, СтруктураДействий, Неопределено);
		
		НомерСтроки = НомерСтроки + 1;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		Попытка
			ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст)
				Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст)
				Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст)
				Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;

		Если НЕ ПустаяСтрока(НомерДокументаРеализации) Тогда
			ДанныеРеализации = ПолучитьДанныеРеализации(НомерДокументаРеализации, НоваяСтрокаТовары.Номенклатура);
			НоваяСтрокаТовары.ДокументРеализации	= ДанныеРеализации.ДокументРеализации;
			НоваяСтрокаТовары.СтавкаНДС				= ДанныеРеализации.СтавкаНДС;
			НоваяСтрокаТовары.Цена					= ДанныеРеализации.Цена;
		КонецЕсли;

		Если НЕ ПустаяСтрока(СтатьяРасходовАктивов) Тогда
			НоваяСтрокаТовары.СтатьяРасходовАктивов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию(СтатьяРасходовАктивов, Истина);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Аналитика) Тогда
			НоваяСтрокаТовары.Аналитика = Справочники.Партнеры.НайтиПоНаименованию(Аналитика, Истина);
		КонецЕсли;

	КонецЦикла;
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	Если ЗагружатьГТД Тогда
		ДополнитьТоварыНомерамиГТД();
	КонецЕсли;
	
	Если Объект.ЗагружатьУпаковочныеЛисты Тогда
		ЗаполнитьУпаковочныеЛисты();
	КонецЕсли;
	
	УточнениеНоменклатуры.Очистить();

КонецПроцедуры

Функция  ПолучитьДанныеРеализации(п_Номер, п_Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслугТовары.Ссылка КАК ДокументРеализации,
		|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслугТовары.Количество <> 0
		|			ТОГДА РеализацияТоваровУслугТовары.СуммаСНДС / РеализацияТоваровУслугТовары.Количество
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
		|	И РеализацияТоваровУслугТовары.Ссылка.Номер = &Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Номер", п_Номер);
	Запрос.УстановитьПараметр("Номенклатура", п_Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Рез = Новый Структура();
	Рез.Вставить("ДокументРеализации",	Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	Рез.Вставить("НомерСтроки",			0);
	Рез.Вставить("СтавкаНДС",			Неопределено);
	Рез.Вставить("СуммаНДС",			0);
	Рез.Вставить("Цена",				0);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;

	Возврат Рез;
	
КонецФункции // ()
